# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTableIterator..::..Current Property
ExportLayerTableIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual KeyValuePair<ExportLayerKey, ExportLayerInfo> Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLayerKey, ExportLayerInfo)
	Get
```

Visual C++
---
```text
public:
virtual property KeyValuePair<ExportLayerKey^, ExportLayerInfo^> Current {
	KeyValuePair<ExportLayerKey^, ExportLayerInfo^> get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ExportLayerTableIterator Class
Autodesk.Revit.DB Namespace